Revit 2026 API

# LabelUtilsGetLabelFor(PipeFlowState, Document) Method

---

Gets the user-visible name for a PipeFlowState.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GetLabelFor(
	PipeFlowState pipeFlowState,
	Document doc
)
```
```vb
Public Shared Function GetLabelFor (
	pipeFlowState As PipeFlowState,
	doc As Document
) As String
```
```cpp
public:
static String^ GetLabelFor(
	PipeFlowState pipeFlowState,
	Document^ doc
)
```
```fsharp
static member GetLabelFor :
        pipeFlowState : PipeFlowState *
        doc : Document -> string
```

#### Parameters

pipeFlowState PipeFlowState
     The PipeFlowState to get the user-visible name.
doc Document
     The document from which to get the PipeFlowState.

#### Return Value

String

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when information for the input PipeFlowState cannot be found. |

The name is obtained in the current Revit language.

#### Reference

LabelUtils Class

GetLabelFor Overload

Autodesk.Revit.DB Namespace